In [1]:
import pandas as pd
import numpy as np

In [2]:
temperatures = pd.read_csv("../data/temperatures.csv")

In [3]:
temperatures.head()
temperatures.info()
temperatures.value_counts()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16500 entries, 0 to 16499
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  16500 non-null  int64
 1   date        16500 non-null  object
 2   city        16500 non-null  object
 3   country     16500 non-null  object
 4   avg_temp_c  16407 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 644.7+ KB

Unnamed: 0  date        city     country        avg_temp_c
0           2000-01-01  Abidjan  Côte D'Ivoire  27.293        1
10829       2008-09-01  Moscow   Russia         10.741        1
10992       2008-07-01  Nagoya   Japan          27.089        1
10993       2008-08-01  Nagoya   Japan          26.974        1
10994       2008-09-01  Nagoya   Japan          23.220        1
                                                             ..
5506        2005-02-01  Harare   Zimbabwe       23.297        1
5507        2005-03-01  Harare   Zimbabwe       22.802        1
5508        2005-04-01  Harare   Zimbabwe       21.280        1
5509        2005-05-01  Harare   Zimbabwe       19.356        1
16498       2013-08-01  Xian     China          24.528        1
Length: 16407, dtype: int64

In [4]:
temp_ind=temperatures.set_index('city')#Move a column from the body of an dataframe to be the index
print(temp_ind)
temp_ind.reset_index(drop=True)

         Unnamed: 0        date        country  avg_temp_c
city
Abidjan           0  2000-01-01  Côte D'Ivoire      27.293
Abidjan           1  2000-02-01  Côte D'Ivoire      27.685
Abidjan           2  2000-03-01  Côte D'Ivoire      29.061
Abidjan           3  2000-04-01  Côte D'Ivoire      28.162
Abidjan           4  2000-05-01  Côte D'Ivoire      27.547
...             ...         ...            ...         ...
Xian          16495  2013-05-01          China      18.979
Xian          16496  2013-06-01          China      23.522
Xian          16497  2013-07-01          China      25.251
Xian          16498  2013-08-01          China      24.528
Xian          16499  2013-09-01          China         NaN

[16500 rows x 4 columns]

       Unnamed: 0        date        country  avg_temp_c
0               0  2000-01-01  Côte D'Ivoire      27.293
1               1  2000-02-01  Côte D'Ivoire      27.685
2               2  2000-03-01  Côte D'Ivoire      29.061
3               3  2000-04-01  Côte D'Ivoire      28.162
4               4  2000-05-01  Côte D'Ivoire      27.547
...           ...         ...            ...         ...
16495       16495  2013-05-01          China      18.979
16496       16496  2013-06-01          China      23.522
16497       16497  2013-07-01          China      25.251
16498       16498  2013-08-01          China      24.528
16499       16499  2013-09-01          China         NaN

[16500 rows x 4 columns]

In [5]:
#indexes make subsetting code cleaner
temperatures[temperatures['city'].isin(['Xian','Mexico'])]
temp_ind.loc[['Xian','Mexico']]#loc filters index values

        Unnamed: 0        date country  avg_temp_c
city
Xian         16335  2000-01-01   China      -2.819
Xian         16336  2000-02-01   China       0.943
Xian         16337  2000-03-01   China       8.997
Xian         16338  2000-04-01   China      13.714
Xian         16339  2000-05-01   China      20.568
...            ...         ...     ...         ...
Mexico       10390  2013-05-01  Mexico      19.155
Mexico       10391  2013-06-01  Mexico      18.924
Mexico       10392  2013-07-01  Mexico      18.091
Mexico       10393  2013-08-01  Mexico      17.882
Mexico       10394  2013-09-01  Mexico      18.313

[330 rows x 4 columns]

In [6]:
#indexing Part2 from Datacamp
cities =['Moscow', 'Saint Petersburg']
print(temperatures[temperatures['city'].isin(cities)])
print(temp_ind.loc[cities])

       Unnamed: 0        date              city country  avg_temp_c
10725       10725  2000-01-01            Moscow  Russia      -7.313
10726       10726  2000-02-01            Moscow  Russia      -3.551
10727       10727  2000-03-01            Moscow  Russia      -1.661
10728       10728  2000-04-01            Moscow  Russia      10.096
10729       10729  2000-05-01            Moscow  Russia      10.357
...           ...         ...               ...     ...         ...
13360       13360  2013-05-01  Saint Petersburg  Russia      12.355
13361       13361  2013-06-01  Saint Petersburg  Russia      17.185
13362       13362  2013-07-01  Saint Petersburg  Russia      17.234
13363       13363  2013-08-01  Saint Petersburg  Russia      17.153
13364       13364  2013-09-01  Saint Petersburg  Russia         NaN

[330 rows x 5 columns]
                  Unnamed: 0        date country  avg_temp_c
city
Moscow                 10725  2000-01-01  Russia      -7.313
Moscow                 10726  2000-02-01  Russia      -3.551
Moscow                 10727  2000-03-01  Russia      -1.661
Moscow                 10728  2000-04-01  Russia      10.096
Moscow                 10729  2000-05-01  Russia      10.357
...                      ...         ...     ...         ...
Saint Petersburg       13360  2013-05-01  Russia      12.355
Saint Petersburg       13361  2013-06-01  Russia      17.185
Saint Petersburg       13362  2013-07-01  Russia      17.234
Saint Petersburg       13363  2013-08-01  Russia      17.153
Saint Petersburg       13364  2013-09-01  Russia         NaN

[330 rows x 4 columns]

In [7]:
cities2 =['Mexico','Mexico']
print(temperatures[temperatures['city'].isin(cities2)])
print(temp_ind.loc[cities2])

       Unnamed: 0        date    city country  avg_temp_c
10230       10230  2000-01-01  Mexico  Mexico      12.694
10231       10231  2000-02-01  Mexico  Mexico      14.677
10232       10232  2000-03-01  Mexico  Mexico      17.376
10233       10233  2000-04-01  Mexico  Mexico      18.294
10234       10234  2000-05-01  Mexico  Mexico      18.562
...           ...         ...     ...     ...         ...
10390       10390  2013-05-01  Mexico  Mexico      19.155
10391       10391  2013-06-01  Mexico  Mexico      18.924
10392       10392  2013-07-01  Mexico  Mexico      18.091
10393       10393  2013-08-01  Mexico  Mexico      17.882
10394       10394  2013-09-01  Mexico  Mexico      18.313

[165 rows x 5 columns]
        Unnamed: 0        date country  avg_temp_c
city
Mexico       10230  2000-01-01  Mexico      12.694
Mexico       10231  2000-02-01  Mexico      14.677
Mexico       10232  2000-03-01  Mexico      17.376
Mexico       10233  2000-04-01  Mexico      18.294
Mexico       10234  2000-05-01  Mexico      18.562
...            ...         ...     ...         ...
Mexico       10390  2013-05-01  Mexico      19.155
Mexico       10391  2013-06-01  Mexico      18.924
Mexico       10392  2013-07-01  Mexico      18.091
Mexico       10393  2013-08-01  Mexico      17.882
Mexico       10394  2013-09-01  Mexico      18.313

[330 rows x 4 columns]

In [8]:
#Hierarchical indexes
temps_ind3=temperatures.set_index(['city','country'])
temps_ind3.loc[['Xian','Mexico']]#subset
#subset on inner levels;pass a list of tuples
temps_ind3.loc[[('Xian','China'),('Mexico','Mexico')]]#has to match all of the conditions from the loc

                Unnamed: 0        date  avg_temp_c
city   country
Xian   China         16335  2000-01-01      -2.819
       China         16336  2000-02-01       0.943
       China         16337  2000-03-01       8.997
       China         16338  2000-04-01      13.714
       China         16339  2000-05-01      20.568
...                    ...         ...         ...
Mexico Mexico        10390  2013-05-01      19.155
       Mexico        10391  2013-06-01      18.924
       Mexico        10392  2013-07-01      18.091
       Mexico        10393  2013-08-01      17.882
       Mexico        10394  2013-09-01      18.313

[330 rows x 3 columns]

In [9]:
#Subsetting and using tuples
temperatures_ind = temperatures.set_index(['country','city'])
rows_to_keep = [('Brazil','Rio De Janeiro'),('Pakistan','Lahore')]
print(temperatures_ind.loc[rows_to_keep])

                         Unnamed: 0        date  avg_temp_c
country  city
Brazil   Rio De Janeiro       12540  2000-01-01      25.974
         Rio De Janeiro       12541  2000-02-01      26.699
         Rio De Janeiro       12542  2000-03-01      26.270
         Rio De Janeiro       12543  2000-04-01      25.750
         Rio De Janeiro       12544  2000-05-01      24.356
...                             ...         ...         ...
Pakistan Lahore                8575  2013-05-01      33.457
         Lahore                8576  2013-06-01      34.456
         Lahore                8577  2013-07-01      33.279
         Lahore                8578  2013-08-01      31.511
         Lahore                8579  2013-09-01         NaN

[330 rows x 3 columns]

In [10]:
temps_ind3.sort_index(level=['city','country'], ascending=[True,False])

                       Unnamed: 0        date  avg_temp_c
city    country
Abidjan Côte D'Ivoire           0  2000-01-01      27.293
        Côte D'Ivoire           1  2000-02-01      27.685
        Côte D'Ivoire           2  2000-03-01      29.061
        Côte D'Ivoire           3  2000-04-01      28.162
        Côte D'Ivoire           4  2000-05-01      27.547
...                           ...         ...         ...
Xian    China               16495  2013-05-01      18.979
        China               16496  2013-06-01      23.522
        China               16497  2013-07-01      25.251
        China               16498  2013-08-01      24.528
        China               16499  2013-09-01         NaN

[16500 rows x 3 columns]

print(temp_ind.sort_index())
print(temp_ind.sort_index(level='city'))
print(temp_ind.sort_index(level=['country','city'], ascending=[True, False]))
#Using the level feature allows for specific column sorting

## Slicing and subsetting with .loc and .iloc

In [11]:
temperatures[2:5]#python starts from zero;last digit is not used or accounted for

   Unnamed: 0        date     city        country  avg_temp_c
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [12]:
temps_srt = temperatures.set_index(['country','city']).sort_index()
print(temps_srt)

                    Unnamed: 0        date  avg_temp_c
country     city
Afghanistan Kabul         7260  2000-01-01       3.326
            Kabul         7261  2000-02-01       3.454
            Kabul         7262  2000-03-01       9.612
            Kabul         7263  2000-04-01      17.925
            Kabul         7264  2000-05-01      24.658
...                        ...         ...         ...
Zimbabwe    Harare        5605  2013-05-01      18.298
            Harare        5606  2013-06-01      17.020
            Harare        5607  2013-07-01      16.299
            Harare        5608  2013-08-01      19.232
            Harare        5609  2013-09-01         NaN

[16500 rows x 3 columns]

In [13]:
#Slicing the outer index level(rows)
temps_srt.loc['China':'Mexico']#final value is included

                   Unnamed: 0        date  avg_temp_c
country city
China   Changchun        3135  2000-01-01     -18.759
        Changchun        3136  2000-02-01     -13.105
        Changchun        3137  2000-03-01      -1.089
        Changchun        3138  2000-04-01       7.297
        Changchun        3139  2000-05-01      16.970
...                       ...         ...         ...
Mexico  Mexico          10390  2013-05-01      19.155
        Mexico          10391  2013-06-01      18.924
        Mexico          10392  2013-07-01      18.091
        Mexico          10393  2013-08-01      17.882
        Mexico          10394  2013-09-01      18.313

[8250 rows x 3 columns]

In [14]:
temps_srt.loc[('China','Xian'):('Mexico','Mexico')]#Slicing the inner index levels correctly(rows)

                Unnamed: 0        date  avg_temp_c
country city
China   Xian         16335  2000-01-01      -2.819
        Xian         16336  2000-02-01       0.943
        Xian         16337  2000-03-01       8.997
        Xian         16338  2000-04-01      13.714
        Xian         16339  2000-05-01      20.568
...                    ...         ...         ...
Mexico  Mexico       10390  2013-05-01      19.155
        Mexico       10391  2013-06-01      18.924
        Mexico       10392  2013-07-01      18.091
        Mexico       10393  2013-08-01      17.882
        Mexico       10394  2013-09-01      18.313

[5775 rows x 3 columns]

In [15]:
#Slicing Columns with the appropriate format
temps_srt.loc[:,'date':'avg_temp_c']

                          date  avg_temp_c
country     city
Afghanistan Kabul   2000-01-01       3.326
            Kabul   2000-02-01       3.454
            Kabul   2000-03-01       9.612
            Kabul   2000-04-01      17.925
            Kabul   2000-05-01      24.658
...                        ...         ...
Zimbabwe    Harare  2013-05-01      18.298
            Harare  2013-06-01      17.020
            Harare  2013-07-01      16.299
            Harare  2013-08-01      19.232
            Harare  2013-09-01         NaN

[16500 rows x 2 columns]

In [16]:
temps_srt.loc[('Mexico','Mexico'):('Zimbabwe','Harare'), 'date':'avg_temp_c']
#Slicing both rows and columns with the precises calls

                       date  avg_temp_c
country  city
Mexico   Mexico  2000-01-01      12.694
         Mexico  2000-02-01      14.677
         Mexico  2000-03-01      17.376
         Mexico  2000-04-01      18.294
         Mexico  2000-05-01      18.562
...                     ...         ...
Zimbabwe Harare  2013-05-01      18.298
         Harare  2013-06-01      17.020
         Harare  2013-07-01      16.299
         Harare  2013-08-01      19.232
         Harare  2013-09-01         NaN

[5940 rows x 2 columns]

In [17]:
#Using slicing to subset dataframes
date_temps = temperatures.set_index('date').sort_index()
print(date_temps)

            Unnamed: 0       city        country  avg_temp_c
date
2000-01-01           0    Abidjan  Côte D'Ivoire      27.293
2000-01-01        8415     Lahore       Pakistan      12.792
2000-01-01       15345   Tangshan          China      -5.406
2000-01-01        5115      Gizeh          Egypt      12.669
2000-01-01        8580    Lakhnau          India      15.152
...                ...        ...            ...         ...
2013-09-01       11549    Nanjing          China         NaN
2013-09-01       11714  New Delhi          India         NaN
2013-09-01       11879   New York  United States      17.408
2013-09-01       12209     Peking          China         NaN
2013-09-01       16499       Xian          China         NaN

[16500 rows x 4 columns]

In [18]:
#slicing by date
date_temps.loc['2000-01-01':'2003-01-01']

,Unnamed: 0,city,country,avg_temp_c
date,,,,
2000-01-01,0,Abidjan,Côte D'Ivoire,27.293
2000-01-01,8415,Lahore,Pakistan,12.792
2000-01-01,15345,Tangshan,China,-5.406
2000-01-01,5115,Gizeh,Egypt,12.669
2000-01-01,8580,Lakhnau,India,15.152
...,...,...,...,...
2003-01-01,4161,Dar Es Salaam,Tanzania,28.100
2003-01-01,11256,Nairobi,Kenya,17.316
2003-01-01,15876,Toronto,Canada,-10.128
2003-01-01,2841,Cape Town,South Africa,20.061
2003-01-01,8121,Kinshasa,Congo (Democratic Republic Of The),24.664

In [19]:
#slicing by date-year
date_temps.loc['2000':'2003']

            Unnamed: 0         city        country  avg_temp_c
date
2000-01-01           0      Abidjan  Côte D'Ivoire      27.293
2000-01-01        8415       Lahore       Pakistan      12.792
2000-01-01       15345     Tangshan          China      -5.406
2000-01-01        5115        Gizeh          Egypt      12.669
2000-01-01        8580      Lakhnau          India      15.152
...                ...          ...            ...         ...
2002-12-01        3995       Dalian          China      -2.292
2002-12-01       11420      Nanjing          China       5.284
2002-12-01       15875      Toronto         Canada      -3.920
2002-12-01       13895        Seoul    South Korea       0.205
2002-12-01         200  Addis Abeba       Ethiopia      18.275

[3600 rows x 4 columns]

In [20]:
#slicing in both directions:
temps_srt.loc[('India','Hyderabad'):('Iraq','Baghdad'), 'date':'avg_temp_c']
#Slicing both rows and columns with the precises calls

                         date  avg_temp_c
country city
India   Hyderabad  2000-01-01      23.779
        Hyderabad  2000-02-01      25.826
        Hyderabad  2000-03-01      28.821
        Hyderabad  2000-04-01      32.698
        Hyderabad  2000-05-01      32.438
...                       ...         ...
Iraq    Baghdad    2013-05-01      28.673
        Baghdad    2013-06-01      33.803
        Baghdad    2013-07-01      36.392
        Baghdad    2013-08-01      35.463
        Baghdad    2013-09-01         NaN

[2145 rows x 2 columns]

In [21]:
#Slicing time series
temperatures_bool = temperatures[(temperatures['date'] >= '2010-01-01') & (temperatures['date'] <= '2011-12-31')]
print(temperatures_bool)
#set date as teh index and sort the index
temperatures_ind = temperatures.set_index('date').sort_index()
#Use .loc[] to subset temperatures_ind for rows in 2010 and 2011
print(temperatures_ind.loc['2010':'2011'])

#Use .loc[] to subset temperatures_ind for rows from Aug 2010 to Feb 2011
print(temperatures_ind.loc['2010-08':'2011-02'])

       Unnamed: 0        date     city        country  avg_temp_c
120           120  2010-01-01  Abidjan  Côte D'Ivoire      28.270
121           121  2010-02-01  Abidjan  Côte D'Ivoire      29.262
122           122  2010-03-01  Abidjan  Côte D'Ivoire      29.596
123           123  2010-04-01  Abidjan  Côte D'Ivoire      29.068
124           124  2010-05-01  Abidjan  Côte D'Ivoire      28.258
...           ...         ...      ...            ...         ...
16474       16474  2011-08-01     Xian          China      23.069
16475       16475  2011-09-01     Xian          China      16.775
16476       16476  2011-10-01     Xian          China      12.587
16477       16477  2011-11-01     Xian          China       7.543
16478       16478  2011-12-01     Xian          China      -0.490

[2400 rows x 5 columns]
            Unnamed: 0        city    country  avg_temp_c
date
2010-01-01        4905  Faisalabad   Pakistan      11.810
2010-01-01       10185   Melbourne  Australia      20.016
2010-01-01        3750   Chongqing      China       7.921
2010-01-01       13155   São Paulo     Brazil      23.738
2010-01-01        5400   Guangzhou      China      14.136
...                ...         ...        ...         ...
2010-12-01        6896     Jakarta  Indonesia      26.602
2010-12-01        5246       Gizeh      Egypt      16.530
2010-12-01       11186      Nagpur      India      19.120
2010-12-01       14981      Sydney  Australia      19.559
2010-12-01       13496    Salvador     Brazil      26.265

[1200 rows x 4 columns]
            Unnamed: 0           city        country  avg_temp_c
date
2010-08-01        2602       Calcutta          India      30.226
2010-08-01       12337           Pune          India      24.941
2010-08-01        6562          Izmir         Turkey      28.352
2010-08-01       15637        Tianjin          China      25.543
2010-08-01        9862         Manila    Philippines      27.101
...                ...            ...            ...         ...
2011-01-01        4257  Dar Es Salaam       Tanzania      28.541
2011-01-01       11352        Nairobi          Kenya      17.768
2011-01-01         297    Addis Abeba       Ethiopia      17.708
2011-01-01       11517        Nanjing          China       0.144
2011-01-01       11847       New York  United States      -4.463

[600 rows x 4 columns]

In [22]:
#Get 23rd row, 2nd column (index 22, 1)
print(temperatures.iloc[22,1])
print(temperatures.iloc[:5]) #slicing to get the first 5 rows
print(temperatures.iloc[:,2:4])#slicing to get columns 3 to 4
print(temperatures.iloc[:5,2:4])#slicing first 5 rows, columns 3 and 4

2001-11-01
   Unnamed: 0        date     city        country  avg_temp_c
0           0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1           1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547
          city        country
0      Abidjan  Côte D'Ivoire
1      Abidjan  Côte D'Ivoire
2      Abidjan  Côte D'Ivoire
3      Abidjan  Côte D'Ivoire
4      Abidjan  Côte D'Ivoire
...        ...            ...
16495     Xian          China
16496     Xian          China
16497     Xian          China
16498     Xian          China
16499     Xian          China

[16500 rows x 2 columns]
      city        country
0  Abidjan  Côte D'Ivoire
1  Abidjan  Côte D'Ivoire
2  Abidjan  Côte D'Ivoire
3  Abidjan  Côte D'Ivoire
4  Abidjan  Côte D'Ivoire

In [23]:
#Working with Pivot tables using PYTHON!!
avg_temp_c_by_city_vs_date= temperatures.pivot_table(
    'avg_temp_c', index='city', columns='date')
print(avg_temp_c_by_city_vs_date)

date         2000-01-01  2000-02-01  2000-03-01  2000-04-01  2000-05-01  \
city
Abidjan          27.293      27.685      29.061      28.162      27.547
Addis Abeba      17.391      19.183      20.230      20.398      19.977
Ahmadabad        20.781      21.246      26.565      32.275      32.847
Aleppo            5.205       6.832      10.421      17.743      22.240
Alexandria       13.579      14.300      15.266      19.556      21.828
...                 ...         ...         ...         ...         ...
Tokyo             3.660       1.765       5.709      11.155      17.261
Toronto          -7.373      -4.177       2.675       4.968      13.068
Umm Durman       23.375      24.991      27.506      32.774      34.786
Wuhan             3.329       5.842      13.016      17.898      23.914
Xian             -2.819       0.943       8.997      13.714      20.568

date         2000-06-01  2000-07-01  2000-08-01  2000-09-01  2000-10-01  ...  \
city                                                                     ...
Abidjan          25.812      24.870      24.884      25.405      26.074  ...
Addis Abeba      18.254      17.109      16.944      17.542      17.113  ...
Ahmadabad        32.490      28.678      28.616      29.087      29.285  ...
Aleppo           27.781      31.957      29.873      25.877      18.846  ...
Alexandria       24.619      27.091      26.930      25.939      22.842  ...
...                 ...         ...         ...         ...         ...  ...
Tokyo            20.396      25.214      25.843      22.005      15.197  ...
Toronto          17.095      18.296      18.522      14.296       9.723  ...
Umm Durman       34.795      32.279      31.233      31.790      30.641  ...
Wuhan            26.511      30.222      28.404      24.146      17.993  ...
Xian             22.387      25.578      22.517      17.823      11.116  ...

date         2012-12-01  2013-01-01  2013-02-01  2013-03-01  2013-04-01  \
city
Abidjan          26.777      27.751      29.021      29.129      28.626
Addis Abeba      17.808      18.852      20.047      21.180      20.570
Ahmadabad        22.325      19.645      22.726      27.196      30.762
Aleppo            8.050       6.601       9.802      12.537      17.326
Alexandria       16.763      15.039      16.083      18.477      19.111
...                 ...         ...         ...         ...         ...
Tokyo             2.961       1.288       2.046       7.955      11.310
Toronto          -1.003      -4.681      -6.743      -1.862       4.657
Umm Durman       24.484      24.668      27.684      30.087      30.309
Wuhan             5.048       4.210       7.200      13.527      17.136
Xian             -0.822      -1.635       2.362      10.110      12.563

date         2013-05-01  2013-06-01  2013-07-01  2013-08-01  2013-09-01
city
Abidjan          27.652      26.157      24.951      24.541         NaN
Addis Abeba      19.774      18.736      18.148      19.005         NaN
Ahmadabad        33.856      31.099      28.073      27.512         NaN
Aleppo           22.917      27.292      29.850      29.704         NaN
Alexandria       23.647      25.329      26.369      27.453         NaN
...                 ...         ...         ...         ...         ...
Tokyo            16.757      20.927      24.645      26.364         NaN
Toronto          13.818      17.367      20.460      18.520      14.599
Umm Durman       35.285      34.516      31.496      31.159         NaN
Wuhan            23.173      26.817      31.171      31.050         NaN
Xian             18.979      23.522      25.251      24.528         NaN

[100 rows x 165 columns]

In [24]:
avg_temp_c_by_city_vs_date.loc['Aleppo':'Cali']#pivot_tables and slicing

date,2000-01-01,2000-02-01,2000-03-01,2000-04-01,2000-05-01,2000-06-01,2000-07-01,2000-08-01,2000-09-01,2000-10-01,...,2012-12-01,2013-01-01,2013-02-01,2013-03-01,2013-04-01,2013-05-01,2013-06-01,2013-07-01,2013-08-01,2013-09-01
city,,,,,,,,,,,,,,,,,,,,,
Aleppo,5.205,6.832,10.421,17.743,22.240,27.781,31.957,29.873,25.877,18.846,...,8.050,6.601,9.802,12.537,17.326,22.917,27.292,29.850,29.704,NaN
Alexandria,13.579,14.300,15.266,19.556,21.828,24.619,27.091,26.930,25.939,22.842,...,16.763,15.039,16.083,18.477,19.111,23.647,25.329,26.369,27.453,NaN
Ankara,-4.621,-2.094,3.045,12.013,14.130,18.459,24.840,22.083,18.037,10.828,...,2.333,0.897,4.325,7.216,11.558,17.464,20.104,21.948,22.625,NaN
Baghdad,10.024,11.943,16.205,25.248,29.980,34.144,38.283,36.737,31.368,24.139,...,12.851,11.518,14.889,17.636,22.769,28.673,33.803,36.392,35.463,NaN
Bangalore,23.673,25.351,27.238,28.501,28.059,25.140,25.015,24.333,25.280,24.635,...,23.881,24.168,25.798,28.057,29.593,29.189,25.835,25.008,25.236,NaN
Bangkok,25.980,26.564,28.626,28.881,28.978,28.080,27.905,28.099,27.572,27.247,...,27.215,26.355,28.648,29.940,30.731,30.927,28.771,28.155,28.351,NaN
Belo Horizonte,23.369,23.617,23.052,21.899,19.990,18.741,18.254,20.606,21.094,24.267,...,24.762,23.094,24.088,23.435,21.706,20.316,19.970,19.498,20.582,NaN
Berlin,1.324,4.718,5.806,11.805,16.376,18.432,16.932,18.930,14.656,12.284,...,0.999,0.113,0.314,-0.391,9.088,14.139,17.473,20.901,19.335,NaN
Bogotá,19.763,19.957,20.226,19.990,20.164,20.414,20.518,21.201,20.118,20.457,...,20.001,20.967,20.549,20.937,21.213,20.612,21.217,21.182,21.451,NaN
Bombay,25.599,24.076,25.489,28.188,28.860,28.342,27.188,27.461,27.997,28.820,...,26.828,24.187,25.005,26.301,27.335,29.718,27.686,26.519,26.953,NaN
Brasília,22.555,22.586,22.637,22.471,21.981,20.931,20.614,22.985,23.119,24.759,...,24.257,22.726,24.034,23.715,22.574,22.369,21.784,21.204,22.405,NaN
Cairo,12.669,13.728,16.026,22.396,24.927,27.514,29.586,28.090,26.400,22.370,...,15.522,14.187,15.931,19.695,21.146,27.100,28.392,28.217,28.588,NaN
Calcutta,19.196,21.275,26.881,30.165,30.245,29.861,29.320,29.694,28.846,28.017,...,19.621,17.757,21.982,27.702,30.435,30.921,30.618,30.000,29.539,NaN
Cali,21.605,21.824,22.084,21.951,21.863,22.000,22.293,22.914,21.735,22.142,...,22.065,22.888,22.315,22.882,22.972,22.328,23.073,23.200,23.180,NaN

In [25]:
avg_temp_c_by_city_vs_date.mean(axis='index')#calculate the statistic across rows

date
2000-01-01    12.324300
2000-02-01    13.901210
2000-03-01    17.297980
2000-04-01    20.674220
2000-05-01    23.036740
                ...
2013-05-01    23.405960
2013-06-01    24.341760
2013-07-01    24.951320
2013-08-01    24.770230
2013-09-01    19.456286
Length: 165, dtype: float64

In [28]:
avg_temp_c_by_city_vs_date.mean(axis='columns')#calculate statistics across columns

city
Abidjan        26.971024
Addis Abeba    18.425378
Ahmadabad      27.431195
Aleppo         18.501244
Alexandria     21.407896
                 ...
Tokyo          13.413512
Toronto         7.230067
Umm Durman     29.981780
Wuhan          17.749591
Xian           12.488933
Length: 100, dtype: float64

In [32]:
#Accessing the date component; temperatures['year']=temperatures['date'].dt.year
temp_by_country_city_vs_date = temperatures.pivot_table('avg_temp_c', index= ['country','city'], columns = 'date')
print(temp_by_country_city_vs_date)

date                            2000-01-01  2000-02-01  2000-03-01  \
country       city
Afghanistan   Kabul                  3.326       3.454       9.612
Angola        Luanda                25.077      25.493      26.496
Australia     Melbourne             18.527      22.095      18.945
              Sydney                18.470      20.713      20.220
Bangladesh    Dhaka                 18.829      20.947      26.035
...                                    ...         ...         ...
United States Chicago                0.137       4.083       8.274
              Los Angeles           10.772      10.262      12.335
              New York              -3.168      -0.162       6.391
Vietnam       Ho Chi Minh City      26.647      26.672      27.655
Zimbabwe      Harare                22.119      21.569      22.370

date                            2000-04-01  2000-05-01  2000-06-01  \
country       city
Afghanistan   Kabul                 17.925      24.658      25.582
Angola        Luanda                25.689      25.113      23.461
Australia     Melbourne             14.839      11.087       9.239
              Sydney                18.602      16.614      14.454
Bangladesh    Dhaka                 28.545      28.684      29.037
...                                    ...         ...         ...
United States Chicago                7.615      13.867      17.939
              Los Angeles           15.684      19.073      22.524
              New York               8.897      15.944      20.234
Vietnam       Ho Chi Minh City      28.378      28.597      28.046
Zimbabwe      Harare                19.999      17.703      16.324

date                            2000-07-01  2000-08-01  2000-09-01  \
country       city
Afghanistan   Kabul                 26.107      25.459      22.116
Angola        Luanda                21.126      21.975      23.530
Australia     Melbourne              8.538       9.230      11.632
              Sydney                14.735      14.474      16.932
Bangladesh    Dhaka                 28.825      29.253      28.688
...                                    ...         ...         ...
United States Chicago               21.087      22.840      19.061
              Los Angeles           23.573      25.053      21.951
              New York              20.727      20.791      17.095
Vietnam       Ho Chi Minh City      28.036      28.089      28.067
Zimbabwe      Harare                15.291      16.914      22.165

date                            2000-10-01  ...  2012-12-01  2013-01-01  \
country       city                          ...
Afghanistan   Kabul                 16.806  ...       4.026       2.347
Angola        Luanda                24.339  ...      25.519      26.331
Australia     Melbourne             12.440  ...      18.425      20.274
              Sydney                17.032  ...      19.617      21.160
Bangladesh    Dhaka                 27.744  ...      19.438      17.116
...                                    ...  ...         ...         ...
United States Chicago               15.110  ...       5.592       1.056
              Los Angeles           15.903  ...       8.712       8.813
              New York              11.323  ...       2.586      -0.968
Vietnam       Ho Chi Minh City      26.901  ...      28.123      26.597
Zimbabwe      Harare                23.800  ...      22.679      22.235

date                            2013-02-01  2013-03-01  2013-04-01  \
country       city
Afghanistan   Kabul                  4.802       8.681      14.936
Angola        Luanda                26.944      26.945      26.233
Australia     Melbourne             21.516      19.964      14.762
              Sydney                20.026      20.483      18.547
Bangladesh    Dhaka                 21.840      27.036      29.012
...                                    ...         ...         ...
United States Chicago               -0.509       1.323       6.644
              Los Angeles            9.804      14.463      15.921
              New York              -1.365       2.518       9.723
Vietnam       Ho Chi Minh City      27.586      28.731      29.360
Zimbabwe      Harare                22.737      22.051      20.180

date                            2013-05-01  2013-06-01  2013-07-01  \
country       city
Afghanistan   Kabul                 21.245      25.859      26.805
Angola        Luanda                25.278      22.864      20.706
Australia     Melbourne             11.836       9.365       9.774
              Sydney                16.947      15.911      15.518
Bangladesh    Dhaka                 28.755      30.133      29.650
...                                    ...         ...         ...
United States Chicago               13.734      17.913      21.914
              Los Angeles           19.028      22.434      25.090
              New York              15.544      20.892      24.722
Vietnam       Ho Chi Minh City      29.688      28.939      28.425
Zimbabwe      Harare                18.298      17.020      16.299

date                            2013-08-01  2013-09-01
country       city
Afghanistan   Kabul                 24.974         NaN
Angola        Luanda                21.130         NaN
Australia     Melbourne             10.441         NaN
              Sydney                16.126         NaN
Bangladesh    Dhaka                 29.154         NaN
...                                    ...         ...
United States Chicago               22.230      19.977
              Los Angeles           24.232      23.301
              New York              21.001      17.408
Vietnam       Ho Chi Minh City      28.314         NaN
Zimbabwe      Harare                19.232         NaN

[100 rows x 165 columns]